tap "agavra/tap"
tap "asmvik/formulae"
tap "bufbuild/buf"
tap "charmbracelet/tap"
tap "conductorone/baton"
tap "conductorone/cone"
tap "felixkratz/formulae", "https://github.com/FelixKratz/homebrew-formulae"
tap "koekeishiya/formulae", "https://github.com/asmvik/homebrew-formulae.git"
tap "mholzen/workflowy"
tap "rtk-ai/tap"
tap "speakeasy-api/tap"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Compiler infrastructure and toolchain library for WebAssembly
brew "binaryen"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Console-based Audio Visualizer for ALSA
brew "cava"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Load/unload environment variables based on $PWD
brew "direnv"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Run arbitrary commands when files change
brew "entr"
# Multi-threaded file-tree visualizer and disk usage analyzer
brew "erdtree"
# Program that can automate interactive applications
brew "expect"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# macOS CLI for managing custom icons for files and folders
brew "fileicon"
# Monitor a directory for changes and run a shell command
brew "fswatch"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Render markdown on the CLI
brew "glow"
# Fast linters runner for Go
brew "golangci-lint"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Like cURL, but for gRPC
brew "grpcurl"
# Improved top (interactive process viewer)
brew "htop"
# Command-line benchmarking tool
brew "hyperfine"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Show ps output as a tree
brew "pstree"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# CLI proxy to minimize LLM token consumption
brew "rtk"
# Cross-shell prompt for astronauts
brew "starship"
# State of the art linter for the Go programming language
brew "staticcheck"
# Tool to build, change, and version infrastructure
brew "terraform"
# Code-search similar to ack
brew "the_silver_searcher"
# Terminal multiplexer
brew "tmux"
# Program that allows you to count code, quickly
brew "tokei"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# High-performance theorem prover
brew "z3"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# Developer platform
cask "dotnet-runtime"
cask "font-fira-code-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Desktop automation application
cask "hammerspoon"
# Keyboard customiser
cask "karabiner-elements"
# Silence embarrassing notifications while screensharing
cask "muzzle"
# Run commands and display their output on the desktop
cask "ubersicht"
# Open-source code editor
cask "visual-studio-code"
vscode "a-bentofreire.vsctoix"
vscode "a5huynh.vscode-ron"
vscode "aaron-bond.better-comments"
vscode "adamcaviness.theme-monokai-dark-soda"
vscode "adamhartford.vscode-base64"
vscode "akamud.vscode-theme-onedark"
vscode "aleksandardev.vscode-sequence-diagrams"
vscode "alexcvzz.vscode-sqlite"
vscode "antyos.openscad"
vscode "christian-kohler.npm-intellisense"
vscode "cl.eide"
vscode "codegraphy.codegraphy"
vscode "conductorone.occult-language"
vscode "dandric.vscode-jq"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.jshint"
vscode "donjayamanne.githistory"
vscode "drblury.protobuf-vsc"
vscode "dtoplak.vscode-glsllint"
vscode "dtsvet.vscode-wasm"
vscode "dunstontc.dark-plus-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "elanandkumar.el-vsc-product-icon-theme"
vscode "esbenp.prettier-vscode"
vscode "file-icons.file-icons"
vscode "foxundermoon.shell-format"
vscode "gamunu.vscode-yarn"
vscode "gavinleroy.argus"
vscode "gerrnperl.outline-map"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hbenl.vscode-test-explorer-liveshare"
vscode "henoc.svgeditor"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "holazz.vsc-reveal"
vscode "hookyqr.beautify"
vscode "irongeek.vscode-env"
vscode "iseos.noname-ui"
vscode "itsjonq.dark-refined"
vscode "jock.svg"
vscode "jomeinaster.bracket-peek"
vscode "juanallo.vscode-dependency-cruiser"
vscode "kale-lab.salt"
vscode "leanprover.lean4"
vscode "learn-game-development.js-syntax-extension"
vscode "lorenzopirro.rust-flash-snippets"
vscode "lukapetrovic.image-resizer"
vscode "lyzerk.linecounter"
vscode "martan03.svg-forge"
vscode "marus25.cortex-debug"
vscode "mcu-debug.debug-tracker-vscode"
vscode "mcu-debug.memory-view"
vscode "mcu-debug.peripheral-viewer"
vscode "mcu-debug.rtos-views"
vscode "miramac.vscode-exec-node"
vscode "mohsen1.prettify-json"
vscode "mrmlnc.vscode-less"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-audio"
vscode "mutantdino.resourcemonitor"
vscode "netcorext.uuid-generator"
vscode "nhoizey.gremlins"
vscode "npaz.vscode-dynamic-layouts"
vscode "oderwat.indent-rainbow"
vscode "panicbit.cargo"
vscode "paperproof.paperproof"
vscode "peymanslh.blueberry-dark-theme"
vscode "polypus74.trusty-rusty-snippets"
vscode "qcz.text-power-tools"
vscode "raczzalan.webgl-glsl-editor"
vscode "radium-v.better-less"
vscode "randomfractalsinc.snippets-viewer"
vscode "rch.vaporwave-theme"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "redis.redis-for-vscode"
vscode "riazxrazor.html-to-jsx"
vscode "romanrei.material-dark"
vscode "rome.rome"
vscode "rust-lang.rust-analyzer"
vscode "seansassenrath.vscode-theme-superonedark"
vscode "shakram02.bash-beautify"
vscode "sirmspencer.vscode-autohide"
vscode "slevesque.shader"
vscode "slevesque.vscode-3dviewer"
vscode "spywhere.whiteviz"
vscode "statiolake.vscode-rustfmt"
vscode "studiobio.bio-dark-theme"
vscode "takumii.markdowntable"
vscode "tamasfe.even-better-toml"
vscode "thomaz.preparing"
vscode "tintinweb.graphviz-interactive-preview"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "wattenberger.footsteps"
vscode "wcrichton.flowistry"
vscode "webfreak.debug"
vscode "weirane.errorviz"
vscode "willluke.nextjs"
vscode "wraith13.background-phi-colors"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
go "github.com/conductorone/spike-classifiers/18-go-afl/cmd/axiom-gaps"
go "golang.org/x/perf/cmd/benchstat"
go "github.com/ductone/clanker-lint/cmd/clanker-lint"
go "golang.org/x/tools/cmd/goimports"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/conductorone/occult/cmd/occult-fmt"
go "github.com/conductorone/occult/cmd/occult-lsp"
go "github.com/conductorone/plaid-lint/cmd/plaid-lint"
go "github.com/ductone/protoc-gen-apigw"
go "connectrpc.com/connect/cmd/protoc-gen-connect-go"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/ductone/sqfan/cmd/sqfan"
go "github.com/ductone/squire/cmd/squire"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/conductorone/terraform-provider-conductorone"
cargo "cargo-audit"
cargo "cargo-deny"
cargo "flowistry_ide"
cargo "mcpls"
cargo "tauri-cli"
cargo "wasm-bindgen-cli"
npm "@earendil-works/pi-coding-agent"
npm "@kazuph/mcp-slack"
npm "@modelcontextprotocol/server-github"
npm "@openai/codex"
npm "@upstash/context7-mcp"
npm "@vtsls/language-server"
npm "mcp-remote"
npm "oh-my-codex"
npm "pnpm"
npm "ts-proto"
npm "vit"
npm "yarn"

# --- GUI apps (were drag-installed; added for new-machine portability) ---
cask "1password"
cask "google-chrome"
cask "rectangle"
cask "spotify"
cask "zoom"
cask "github"
cask "jetbrains-toolbox"
cask "twingate"
cask "iterm2"
cask "cursor"
cask "claude"
cask "notion"
cask "linear"
cask "mem"
cask "slack"
cask "workflowy"
