# Brewfile - install with: brew bundle
# Update with: brew bundle dump --force

# Taps
tap "homebrew/bundle"

# Core CLI tools
brew "coreutils"       # GNU coreutils (gls, gcat, etc.)
brew "bash"            # Modern bash
brew "zsh"             # Modern zsh

# Modern replacements
brew "eza"             # ls replacement
brew "bat"             # cat replacement
brew "fd"              # find replacement
brew "ripgrep"         # grep replacement
brew "zoxide"          # cd replacement
brew "fzf"             # fuzzy finder
brew "delta"           # git diff pager
brew "atuin"           # shell history

# Development
brew "git"
brew "gh"              # GitHub CLI
brew "jq"              # JSON processor
brew "yq"              # YAML processor
brew "tokei"           # Code stats
brew "direnv"          # Per-directory env

# Terminal/shell
brew "starship"        # Prompt
brew "glow"            # Markdown renderer
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Languages (uncomment as needed)
brew "go"
brew "node"
# brew "python"
# brew "rust"

# Infrastructure (uncomment as needed)
# brew "docker"
# brew "colima"          # Docker runtime for macOS
# brew "kubectl"
# brew "terraform"

# Utilities
brew "curl"
brew "wget"
brew "watch"
brew "htop"
brew "tree"
brew "expect"          # For unbuffer

# Cloud CLI tools
brew "awscli"          # AWS CLI v2

# Casks (GUI apps) - uncomment as needed
# cask "ghostty"
# cask "iterm2"
# cask "visual-studio-code"
# cask "cursor"
# cask "docker"
