# Brewfile - install with: brew bundle
# Update with: brew bundle dump --force

# Taps
tap "homebrew/bundle"

# === Core CLI ===
brew "coreutils"
brew "bash"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "zsh-completions"

# === Modern Rust Tools ===
brew "eza"             # ls replacement
brew "bat"             # cat replacement
brew "fd"              # find replacement
brew "ripgrep"         # grep replacement
brew "zoxide"          # cd replacement
brew "fzf"             # fuzzy finder
brew "git-delta"       # git diff pager
brew "atuin"           # shell history
brew "tokei"           # code stats
brew "yazi"            # file manager TUI
brew "zellij"          # terminal multiplexer (tmux alternative)

# === Git & GitHub ===
brew "git"
brew "gh"
brew "difftastic"      # structural diff (understands syntax, not just lines)

# === Terminal & Shell ===
brew "starship"        # prompt
brew "glow"            # markdown renderer
brew "tmux"            # terminal multiplexer
brew "neovim"          # modern vim

# === Data Formats ===
brew "jq"              # JSON processor
brew "yq"              # YAML processor
brew "curl"
brew "wget"

# === Development ===
brew "go"
brew "golangci-lint"
brew "staticcheck"
brew "node"
brew "deno"
brew "python@3.14"
brew "direnv"

# === Proto/gRPC ===
brew "protobuf"
brew "grpcurl"
tap "bufbuild/buf"
brew "bufbuild/buf/buf"

# === Containers & Infra ===
brew "docker"
brew "docker-compose"
brew "colima"          # Docker runtime for macOS
brew "terraform"

# === Cloud ===
brew "awscli"

# === AI ===
brew "ollama"

# === Media & Visualization ===
brew "ffmpeg"
brew "graphviz"

# === Utilities ===
brew "watch"
brew "expect"          # unbuffer
brew "pstree"
brew "cowsay"
brew "figlet"
brew "pastel"          # color manipulation
brew "gum"             # glamorous shell scripts (spinners, prompts, styling)

# === Casks (uncomment as needed) ===
# cask "ghostty"
# cask "visual-studio-code"
# cask "cursor"
