a-bentofreire.vsctoix
a5huynh.vscode-ron
aaron-bond.better-comments
adamcaviness.theme-monokai-dark-soda
adamhartford.vscode-base64
akamud.vscode-theme-onedark
aleksandardev.vscode-sequence-diagrams
alexcvzz.vscode-sqlite
antyos.openscad
christian-kohler.npm-intellisense
cl.eide
codegraphy.codegraphy
conductorone.occult-language
dandric.vscode-jq
davidanson.vscode-markdownlint
dbaeumer.jshint
donjayamanne.githistory
drblury.protobuf-vsc
dtoplak.vscode-glsllint
dtsvet.vscode-wasm
dunstontc.dark-plus-syntax
eamodio.gitlens
ecmel.vscode-html-css
elanandkumar.el-vsc-product-icon-theme
esbenp.prettier-vscode
file-icons.file-icons
foxundermoon.shell-format
gamunu.vscode-yarn
gavinleroy.argus
gerrnperl.outline-map
golang.go
graphql.vscode-graphql-syntax
gruntfuggly.todo-tree
hashicorp.hcl
hashicorp.terraform
hbenl.vscode-test-explorer
hbenl.vscode-test-explorer-liveshare
henoc.svgeditor
hnw.vscode-auto-open-markdown-preview
holazz.vsc-reveal
hookyqr.beautify
irongeek.vscode-env
iseos.noname-ui
itsjonq.dark-refined
jock.svg
jomeinaster.bracket-peek
juanallo.vscode-dependency-cruiser
kale-lab.salt
leanprover.lean4
learn-game-development.js-syntax-extension
lorenzopirro.rust-flash-snippets
lukapetrovic.image-resizer
lyzerk.linecounter
martan03.svg-forge
marus25.cortex-debug
mcu-debug.debug-tracker-vscode
mcu-debug.memory-view
mcu-debug.peripheral-viewer
mcu-debug.rtos-views
miramac.vscode-exec-node
mohsen1.prettify-json
mrmlnc.vscode-less
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-kubernetes-tools.vscode-kubernetes-tools
ms-python.debugpy
ms-python.isort
ms-python.python
ms-python.vscode-pylance
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode.cpptools
ms-vscode.makefile-tools
ms-vscode.remote-explorer
ms-vscode.sublime-keybindings
ms-vscode.test-adapter-converter
ms-vscode.vscode-typescript-next
ms-vsliveshare.vsliveshare
ms-vsliveshare.vsliveshare-audio
mutantdino.resourcemonitor
netcorext.uuid-generator
nhoizey.gremlins
npaz.vscode-dynamic-layouts
oderwat.indent-rainbow
panicbit.cargo
paperproof.paperproof
peymanslh.blueberry-dark-theme
polypus74.trusty-rusty-snippets
qcz.text-power-tools
raczzalan.webgl-glsl-editor
radium-v.better-less
randomfractalsinc.snippets-viewer
rch.vaporwave-theme
redhat.vscode-commons
redhat.vscode-yaml
redis.redis-for-vscode
riazxrazor.html-to-jsx
romanrei.material-dark
rome.rome
rust-lang.rust-analyzer
seansassenrath.vscode-theme-superonedark
shakram02.bash-beautify
sirmspencer.vscode-autohide
slevesque.shader
slevesque.vscode-3dviewer
spywhere.whiteviz
statiolake.vscode-rustfmt
studiobio.bio-dark-theme
takumii.markdowntable
tamasfe.even-better-toml
thomaz.preparing
tintinweb.graphviz-interactive-preview
usernamehw.errorlens
vadimcn.vscode-lldb
wattenberger.footsteps
wcrichton.flowistry
webfreak.debug
weirane.errorviz
willluke.nextjs
wraith13.background-phi-colors
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
zignd.html-css-class-completion
